# formula
brew "chezmoi"
brew "fish"
brew "gh"
brew "git"
brew "mas"
brew "vim"
brew "volta"
brew "fzf"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "colima"
brew "zellij"
brew "gemini-cli"
brew "mise"
brew "aws-cli"


# cask
cask "alacritty"
cask "ankerwork"
cask "figma"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "spotify"
cask "visual-studio-code"
cask "messenger"
cask "slack"
cask "webstorm"
cask "goland"
cask "datagrip"
cask "cloudflare-warp"
cask "claude"
cask "claude-code"

# mas
mas "LINE", id: 539883307
mas "Magnet", id: 441258766

# vscode
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "janisdd.vscode-edit-csv"
vscode "ritwickdey.liveserver"
vscode "withfig.fig"
