# tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"


# formula
brew "chezmoi"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "mas"
brew "vim"
brew "volta"

# cask
cask "alacritty"
cask "alfred"
cask "ankerwork"
cask "cursor"
cask "figma"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "font-source-code-pro-for-powerline"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "spotify"
cask "visual-studio-code"
cask "messenger"
cask "slack"

# mas
mas "LINE", id: 539883307
mas "Magnet", id: 441258766

# vscode
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "janisdd.vscode-edit-csv"
vscode "ritwickdey.liveserver"
vscode "withfig.fig"
