chrmarti.regex
CoenraadS.bracket-pair-colorizer
dbaeumer.vscode-eslint
esbenp.prettier-vscode
Gruntfuggly.todo-tree
ionutvmi.path-autocomplete
jcbuisson.vue
octref.vetur
ryu1kn.partial-diff
sdras.vue-vscode-snippets
shardulm94.trailing-spaces
